fixed diagram
